Revit 2026 API

# ComboBoxData Constructor

---

Constructs a new instance of ComboBoxData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ComboBoxData(
	string name
)
```
```vb
Public Sub New (
	name As String
)
```
```cpp
public:
ComboBoxData(
	String^ name
)
```
```fsharp
new :
        name : string -> ComboBoxData
```

#### Parameters

name String
    The internal name of the ComboBoxMember.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for name. |
| ArgumentException | Thrown when an empty string is passed for name. |

#### Reference

ComboBoxData Class

Autodesk.Revit.UI Namespace